Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.SplitSegment(System.Int32)
Split the panel schedule into
Thrown if the index is out of bounds.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The iSeg is not a valid segment index.
-or-
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.GetSchedule
Gets the panel schedule view.
Returns:
The panel schedule view element.
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.View)
Creates a new instance of panel schedule on sheet and adds it to the document.
Returns:
The newly created panel schedule sheet instance element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.ScheduleId
The panel schedule id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.Origin
The sheet instance offset in drawing sheet coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance
The class represents an instance of a panel schedule placed on sheet.
Since:
2011